In [1]:
import os
import datetime as dt
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sqlalchemy import create_engine

%matplotlib inline

In [2]:
try:
    connection_string = os.environ["CONNECTION_STRING"]
except:
    connection_string = 'postgresql://user:pass@warehouse:5432/warehouse_db'

engine = create_engine(connection_string)

In [3]:
query = """
    SELECT date,
        hour,
        name,
        short_measure_name,
        value
    FROM fact_measure fm
        JOIN dim_date dd ON fm.date_id = dd.id
        JOIN dim_time dt ON fm.time_id = dt.id
        JOIN dim_station ds ON fm.source_id = ds.id
        JOIN dim_measurement_type dmt ON fm.measurement_type_id = dmt.id
    WHERE date >= '2019/01/01' AND date <= '2019/05/31'
    ORDER BY name, date, hour
"""
data = pd.read_sql(query, engine)

print(f"Shape: {data.shape}")
data.head()

Shape: (324366, 5)

         date  hour        name short_measure_name  value
0  2019-01-01     0  CALETILLAS               PM10   29.0
1  2019-01-01     0  CALETILLAS              PM2.5   17.0
2  2019-01-01     0  CALETILLAS                NO2   24.0
3  2019-01-01     0  CALETILLAS                 O3   35.0
4  2019-01-01     0  CALETILLAS                SO2    8.0

In [4]:
measure_columns = data.pivot(columns="short_measure_name", values="value")

df = data.drop(columns=["value", "short_measure_name"])
df = pd.concat([df, measure_columns], axis=1)
df = df.groupby(["name", "date", "hour"]).mean().reset_index()

df.head()

,name,date,hour,NO2,O3,P,PM10,PM2.5,PP,RH,SO2,SR,T,WD,WS
0,CALETILLAS,2019-01-01,0,24.0,35.0,NaN,29.0,17.0,NaN,NaN,8.0,NaN,NaN,NaN,NaN
1,CALETILLAS,2019-01-01,1,21.0,44.0,NaN,18.0,8.0,NaN,NaN,11.0,NaN,NaN,NaN,NaN
2,CALETILLAS,2019-01-01,2,23.0,35.0,NaN,24.0,10.0,NaN,NaN,13.0,NaN,NaN,NaN,NaN
3,CALETILLAS,2019-01-01,3,16.0,50.0,NaN,27.0,10.0,NaN,NaN,10.0,NaN,NaN,NaN,NaN
4,CALETILLAS,2019-01-01,4,16.0,49.0,NaN,17.0,8.0,NaN,NaN,19.0,NaN,NaN,NaN,NaN

In [5]:
df["datetime"] = pd.to_datetime(df["date"]) + pd.to_timedelta(df["hour"], unit='h')
df.drop(["date", "hour"], axis=1, inplace=True)
df.head()

,name,NO2,O3,P,PM10,PM2.5,PP,RH,SO2,SR,T,WD,WS,datetime
0,CALETILLAS,24.0,35.0,NaN,29.0,17.0,NaN,NaN,8.0,NaN,NaN,NaN,NaN,2019-01-01 00:00:00
1,CALETILLAS,21.0,44.0,NaN,18.0,8.0,NaN,NaN,11.0,NaN,NaN,NaN,NaN,2019-01-01 01:00:00
2,CALETILLAS,23.0,35.0,NaN,24.0,10.0,NaN,NaN,13.0,NaN,NaN,NaN,NaN,2019-01-01 02:00:00
3,CALETILLAS,16.0,50.0,NaN,27.0,10.0,NaN,NaN,10.0,NaN,NaN,NaN,NaN,2019-01-01 03:00:00
4,CALETILLAS,16.0,49.0,NaN,17.0,8.0,NaN,NaN,19.0,NaN,NaN,NaN,NaN,2019-01-01 04:00:00

In [6]:
dates = pd.date_range(start="2019/01/01", end="2019/05/31 23:00:00", freq="H")
names = df['name'].unique()
idx = pd.MultiIndex.from_product((dates, names), names=['datetime', 'name'])

df = df.set_index(['datetime', 'name']).reindex(idx).reset_index()
df.head()

,datetime,name,NO2,O3,P,PM10,PM2.5,PP,RH,SO2,SR,T,WD,WS
0,2019-01-01,CALETILLAS,24.0,35.0,NaN,29.0,17.0,NaN,NaN,8.0,NaN,NaN,NaN,NaN
1,2019-01-01,CASA CUNA,45.0,12.0,990.0,67.0,36.0,NaN,54.0,2.0,NaN,15.2,299.0,0.1
2,2019-01-01,DEPOSITO DE TRISTAN,45.0,32.0,991.0,24.0,24.0,NaN,49.0,7.0,NaN,15.8,236.0,1.3
3,2019-01-01,GARCIA ESCAMEZ,45.0,15.0,1003.0,31.0,25.0,NaN,51.0,12.0,NaN,15.2,281.0,0.7
4,2019-01-01,LA BUZANADA,6.0,82.0,NaN,7.0,3.0,NaN,NaN,5.0,NaN,NaN,NaN,NaN

In [7]:
sorted_cols = [
    'name',
    'PM2.5', 'PM10', 'O3', 'NO2', 'SO2', 
    'WS', 'WD', 'P', 'PP', 'RH', 'SR', 'T'
]

are_nans = df.set_index(["name", "datetime"]).isna().reset_index().loc[:, sorted_cols]
percentage_nans = are_nans.groupby("name").mean() * 100
percentage_nans = percentage_nans.round(2)

percentage_nans

,PM2.5,PM10,O3,NO2,SO2,WS,WD,P,PP,RH,SR,T
name,,,,,,,,,,,,
CALETILLAS,0.69,1.96,0.44,19.01,0.52,100.00,100.00,100.00,100.00,100.00,100.00,100.00
CASA CUNA,22.79,21.83,21.03,27.68,21.58,20.75,20.75,20.75,100.00,20.75,100.00,20.75
DEPOSITO DE TRISTAN,23.70,23.70,23.73,24.12,23.32,22.99,22.99,23.01,100.00,22.99,100.00,22.99
GARCIA ESCAMEZ,20.36,20.36,20.92,20.53,20.61,20.36,20.36,20.36,100.00,20.36,100.00,20.36
LA BUZANADA,1.02,0.83,0.58,0.50,0.58,100.00,100.00,100.00,100.00,100.00,100.00,100.00
LA HIDALGA - ARAFO,22.16,22.30,21.72,33.50,25.08,29.97,21.03,20.92,20.92,21.25,21.03,21.03
LA ZAMORA,100.00,5.68,4.19,1.88,2.76,15.81,3.81,100.00,3.86,3.92,4.33,4.06
PARQUE LA GRANJA,26.30,26.30,21.91,21.80,39.71,20.89,20.89,20.89,100.00,20.89,100.00,20.89
PISCINA MUNICIPAL,100.00,20.23,20.58,22.02,21.41,0.33,0.47,0.33,0.33,0.33,0.33,0.33
SAN ISIDRO,3.70,3.12,100.00,2.15,2.10,100.00,100.00,100.00,100.00,100.00,100.00,100.00
TOME CANO,4.53,5.74,1.49,1.49,2.76,0.47,1.71,0.36,0.30,0.36,0.36,0.36

Lots of missing values. Only _Caletillas, La Buzanada, La Zamora, San Isidro & Tome Cano_ look like decent stations because they have the lowest percentage of pollution data missing. Though the only one with all features is _Tome Cano_ and out of these 5 stations, this is the only one located in the capital